// Завдання 1
// Написати розв’язок нижче описаного завдання за допомогою arrow function:

// 1. Створити функцію яка прийматиме одне числове значення.
// 2. Це значення в функції означатиме кількіть елементів послідовності Фібаначі.
// 3. Обрахуйте цю послідовність і виведіть виведіть всі її елементи в консоль.

// Приклад роботи:
// 1. fib(5) – має повернути 1 1 2 3 5.
// 2. fib(10) – має повернути 1 1 2 3 5 8 13 21 34 55.

let fib = (n) => {
  let a = 0,
    b = 1,
    str = "";

  for (let i = 0; i < n; i += 1) {
    let f = a + b;

    a = b;
    b = f;
    str += a + "  ";
  }

  return str;
};

console.log(fib(5));
console.log(fib(10));
