// Завдання 2

// Написати розв’язок нижче описаного завдання за допомогою function expression:
// Створіть функцію, яка обраховує суму чисел геометричної прогресії, в якій першим числом є 1. Інформація про геометричну прогресію знаходиться тут:
// 1. https://uk.wikipedia.org/wiki/Геометрична _прогресія
// 2. http://ua.onlinemschool.com/math/formula/geometric_sequence/
// Функція приймає два аргументи: кількість чисел прогресії і її знаменник . Наприклад, в прогресії типу 1,2,4,8,16 кількість чисел - 5, а знаменник – 2 (тому що кожне наступне число прогресії домножується на 2). Результат, який має повернути функція для даної прогресії 31.

// Функцію потрібно написати двома способами:
// 1. З використанням циклу
// 2. З використанням формули знаходження суми геометричної прогресії:

// Sn=b1*1-qn1-q,
// де b1 – перший елемент прогресії (в даному завданні це 1),
// q – знаменник,
// n – кількість елементів прогресії

// Приклад роботи:
// f(5,2) – має повернути 1+2+4+8+16=31
// f(4,3) – має повернути 1+3+9+27=40

let f = function (n, q) {
  let b1 = 1;
  let sum = 0;

  for (let i = 1; i <= n; i += 1) {
    sum += b1;
    b1 *= q;
  }

  return sum;
};

console.log(f(5, 2));
console.log(f(4, 3));

let f = function (n, q) {
  let b1 = 1;
  let Sn = 0;

  Sn = (b1 * (1 - q ** n)) / (1 - q);

  console.log(Sn);
};

f(5, 2);
f(4, 3);

let f = (n, q) => (1 - q ** n) / (1 - q);

console.log(f(5, 2));
console.log(f(4, 3));