// Завдання 1

// Написати розв’язок нижче описаного завдання за допомогою конструкції switch:
// 1. Користувач вводить число в prompt
// 2. Після введення числа вистрибує алерт з оголошенням пори року до якої відноситься число (номер місяця) що ввів користувач.
// 3. Якщо число не входить в діапазон від 1 до 12 тоді виводить що це неможливо.

let seasons = +prompt(`Введіть місяць`);

switch (seasons) {
  case 12:
  case 1:
  case 2:
    console.log(`Це зима!`);
    break;

  case 3:
  case 4:
  case 5:
    console.log(`Це весна!`);
    break;

  case 6:
  case 7:
  case 8:
    console.log(`Це літо!`);
    break;

  case 9:
  case 10:
  case 11:
    console.log(`Це осінь!`);
    break;

  default:
    console.log(`Місяць не знайдено  :( `);
    break;
}
