// Завдання 0
// Пароль і 4 спроби. Завдання виконуємо через while або do while.
// 1. Запросити у користувача пароль!
// 2. Якщо пароль не вірний повідомити що залишилось 4 спроби!
// - якщо далі невірні паролі спроби зменшуються.
// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".
// 3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".
// 4. Завдання реалізуємо без break і міток!

let pass = 123456;
let i = 5;

while (i > 0) {
  let ask = +prompt(`Введіть свій пароль, ще ${i}`);
  if (ask == pass) {
    console.log("Запрошуємо на сайт!");
  } else {
    console.log("Будь ласка спробуйте пізніше!");
  }

  i--;
}
