// 8. Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти. Задачу бажано виконати використовуючи 1 цикл!

// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;

let a = +prompt("Введіть число");
let b = +prompt("Введіть степінь");
let result = 1;
let i = 1;

while (i <= b || i <= -b) {
  result *= a;

  if (-b > 0) {
    let i = 1;
    while (i <= b || i <= -b) {
      result *= 1 / a;
      i++;
    }
  }

  i++;
}

document.write(`<h2> ${result}</h2>`);
