// Завдання 3

// Написати розв’язок нижче описаного завдання за допомогою function declaration:
// 1. Потрібно створити функцію, яка повертає максимальний переданий їй числовий параметр.
// 2. Кількість параметрів у функції може бути від 2х і більше.
// 3. Забороняється використовувати Math.max().

// Приклад роботи:
// 1. max(5,-2) – має повернути 5.
// 2. max(5,-2, 30, 6) – має повернути 30

function maxNumber(...arg) {
  let max = 0;

  for (let i = 0; i < arg.length; i += 1)
    if (max < arg[i]) {
      max = arg[i];
    }

  console.log(max);
}

maxNumber(5, -2);
maxNumber(5, -2, 30, 6);